* Isunnguata_M1-10
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Isunnguata_M1-10
Place Name                       | Isunnguata Sermia
Geographic Location              | Central West Greenland
Ice Type                         | Ice sheet
Data Reference                   | T. Meierbachtol email
Data DOI                         | 
Science Reference                | Harrington, Joel A., Humphrey, Neil F., Harper, Joel T.: Temperature distribution and thermal anomalies along a flowline of the Greenland ice sheet , Annals of Glaciology 56(70), 98–104, 2015 
Science DOI                      | 10.3189/2015AoG70A939
Date                             | 2010
Longitude [°E]                   | -50.06427
Latitude [°N]                    | 67.16221
Location source                  | T. Meierbachtol email
Depth of top measurement [m]     | 10.0
Depth of bottom measurement [m]  | 90
Ice thickness [m]                | 99
Coverage [% of thickness]        | 81
Ice thickness source             | T. Meierbachtol email
General_Note                     | See data in M1-10 folder
Temperature_note                 | 
Thickness_note                   | 
Location_note                    | Harrington 2015 name: S1-A
#+end_example

** Temperature

** Thickness

** Location

** Velocity

** Notes

+ See updated naming schemed in McDowell (2021) and Hills (2017)

#+BEGIN_EXAMPLE
From: Joel Harper
To: Ken Mankoff, Benjamin Hills
Cc: William Colgan, Anja Løkkegaard, Toby Meierbachtol
Subject: RE: Ice borehole temperatures
Date: Tue 10 Aug 2021 08:29:11 AM PDT
Attachments:
 [1]Wright_et_al-2016-Journal_of_Geophysical_Research__Earth_Surface.pdf(4.6M)

[W]e abandoned the 'Site' naming convention used in the original
Harrington [2015] paper in favor of a 'km from terminus/yr'... e.g.,
46km-11 = 46km from the Isunnguata Sermia terminus, site established
in 2011 (see figure 2 [ed: Wright (2016)]). If the hole was drilled in
2011 for example, a particular dataset may have been collected in any
subsequent year since the instrumentation typically runs for up to a
few years. Site 33 km was established with several boreholes in 2014,
but we returned and drilled additional holes at this site in 2015
and 2016.

Harrington’s S5 is the 46km site.
#+END_EXAMPLE

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|    d |      t |
| 10.0 |    0.0 |
| 20.0 |    0.0 |
| 30.0 | -0.012 |
| 40.0 |   0.02 |
| 50.0 |    0.0 |
| 60.0 |  -0.02 |
| 70.0 |  -0.02 |
| 80.0 |  -0.04 |
| 90.0 |  -0.03 |

